{
    "title": "Professional Experience",
    "list": [
        {
            "name": "Welbi Technologies Inc.",
            "description": "Help senior living communities deliver exceptional and unique life experiences with our state-of-the-art recreational platform.",
            "link": "https://www.welbi.co/",
            "projects": [
                {
                    "title": {
                        "text": "Software Developer",
                        "githubLink": null,
                        "otherLink": null
                    },
                    "startDate": "January 2019",
                    "endDate": "Present",
                    "description": "Building a unique Recreation platform to help senior living and long term care facilities",
                    "which": [
                        "Designed and implemented a typescript RESTful API using TypeScript and Express to provide support for recreation and administration staff in retirement communities across the country.",
                        "Lead the design and implementation of core systems, everything from authentication to customizable surveys and everything in between.",
                        "Collaborated with third party vendors to allow real time data synchronization and reporting between systems, leading to increased client revenue and unlocking sales to many potential clients and scaling our client base by over 200%.",
                        "Built a real time data driven analytics system and data aggregation tools using GraphQL and NextJS with end-to-end typing."
                    ],
                    "techStack": ["TypeScript", "React", "Express", "GraphQL", "PostgreSQL", "NestJS"]
                }
            ]
        },
        {
            "name": "Louisville Geek LLC",
            "description": "Louisville Geek, LLC. is a privately-owned Information Technology company based out of Louisville, KY. Founded in 2004, we provide comprehensive managed IT services for a diverse range of businesses and non-profit organizations throughout the country.",
            "link": "https://louisvillegeek.com/it-services/web-software-development/",
            "projects": [
                {
                    "title": {
                        "text": "Full Stack Web Developer",
                        "githubLink": null,
                        "otherLink": null
                    },
                    "startDate": "February 2017",
                    "endDate": "December 2018",
                    "which": [
                        "Designed and built a mobile form designer for aggregating data on the safety of critical energy infrastructure, resulting in greatly improved on-site efficiency for the client.",
                        "Built a native android application to scan, verify and gather data from thousands of different identity documents that is used by a major automobile rental agency.",
                        "Designed and built a task tracker for one of the largest airport service providers that is used across the US in multiple major airline hubs."
                    ],
                    "techStack": ["JavaScript", "Laravel", "PHP", "MySQL", "Angular", "Ionic", "Android", "Java"]
                }
            ]
        }
    ]
}
